Revit 2027 API
CompoundStructureLayer.LayerCapFlag Property
 Identifies if the layer participates in wrapping at end caps and/or inserts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool LayerCapFlag { get; set; }
Public Property LayerCapFlag As Boolean
	Get
	Set
public:
property bool LayerCapFlag {
	bool get ();
	void set (bool value);
}
member LayerCapFlag : bool with get, set
Property Value
Boolean
 True if the layer participates in wrapping, false otherwise. It is meaningful only for Shell layers (for Core layers, the value is always true). The default value is true.
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace